Revit 2027 API
ExternalFileReference.GetPath Method
 Gets the path of the link, relative or absolute according to the link's settings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetPath()
Public Function GetPath As ModelPath
public:
ModelPath^ GetPath()
member GetPath : unit -> ModelPath
Return Value
ModelPath
 The path of the link. This path will be relative for relatively-pathed links.
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace